In [1]:
import sqlite3
import pandas as pd

pd.set_option('display.max_rows', 500)

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('data/boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [5]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT 'CRIM' column, count(*) - count(CRIM) n_empty FROM boston
    UNION ALL
    SELECT 'ZN', count(*) - count(ZN) FROM boston
    UNION ALL
    SELECT 'INDUS', count(*) - count(INDUS) FROM boston
    UNION ALL
    SELECT 'CHAS', count(*) - count(CHAS) FROM boston
    UNION ALL
    SELECT 'NOX', count(*) - count(NOX) FROM boston
         
    ''',
    con,
)

  column  n_empty
0   CRIM        0
1     ZN        0
2  INDUS        0
3   CHAS        0
4    NOX        0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT 'CRIM' column, count(distinct CRIM) n_unique FROM boston
    UNION ALL
    SELECT 'ZN', count(distinct ZN) FROM boston
    UNION ALL
    SELECT 'INDUS', count(distinct INDUS) FROM boston
    UNION ALL
    SELECT 'CHAS', count(distinct CHAS) FROM boston
    UNION ALL
    SELECT 'NOX', count(distinct NOX) FROM boston
    ''',
    con,
)

  column  n_unique
0   CRIM       504
1     ZN        26
2  INDUS        76
3   CHAS         2
4    NOX        81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [9]:
tasks+=1
pd.read_sql(
    '''
    WITH cte AS (
        SELECT CRIM, ZN, INDUS, CHAS, NOX, 
            row_number() over (order by CRIM) crim_rn, 
            row_number() over (order by ZN) zn_rn, 
            row_number() over (order by INDUS) indus_rn, 
            row_number() over (order by CHAS) chas_rn, 
            row_number() over (order by NOX) nox_rn, 
            count(*) over () cnt
        FROM boston
    )
    SELECT column FROM (
        SELECT 'ZN' column, MIN(ZN) min, AVG(CASE WHEN zn_rn IN (cnt / 2 + 1, (cnt - 1 + cnt % 2) / 2 + 1) THEN ZN END) median FROM cte
        UNION ALL
        SELECT 'CRIM', MIN(CRIM), AVG(CASE WHEN crim_rn IN (cnt / 2 + 1, (cnt - 1 + cnt % 2) / 2 + 1) THEN CRIM END) FROM cte
        UNION ALL
        SELECT 'INDUS', MIN(INDUS), AVG(CASE WHEN indus_rn IN (cnt / 2 + 1, (cnt - 1 + cnt % 2) / 2 + 1) THEN INDUS END) FROM cte
        UNION ALL
        SELECT 'CHAS', MIN(CHAS), AVG(CASE WHEN chas_rn IN (cnt / 2 + 1, (cnt - 1 + cnt % 2) / 2 + 1) THEN CHAS END) FROM cte
        UNION ALL
        SELECT 'NOX', MIN(NOX), AVG(CASE WHEN nox_rn IN (cnt / 2 + 1, (cnt - 1 + cnt % 2) / 2 + 1) THEN NOX END) FROM cte
    ) WHERE min = median
    ''',
    con,
)
# –í—ã–≤–æ–¥—ã:
# ZN: –±–æ–ª–µ–µ –ø–æ–ª–æ–≤–∏–Ω—ã —Ä–∞–π–æ–Ω–æ–≤ –ë–æ—Å—Ç–æ–Ω–∞ –∏–º–µ—é—Ç –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–µ –∫–æ–ª-–≤–æ —É—á–∞—Å—Ç–∫–æ–≤ –ø–ª–æ—â–∞–¥—å—é –æ—Ç 25000 –∫–≤. —Ñ—É—Ç–æ–≤ 
#     (—Ç–æ—á–Ω–µ–µ, –Ω–µ –∏–º–µ—é—Ç –∏—Ö –≤–æ–æ–±—â–µ, —Ç.–∫. `data.ZN.min() == 0.0`)
# CHAS: –±–æ–ª–µ–µ –ø–æ–ª–æ–≤–∏–Ω—ã —Ä–∞–π–æ–Ω–æ–≤ –ë–æ—Å—Ç–æ–Ω–∞ –Ω–µ –∏–º–µ—é—Ç –¥–æ—Å—Ç—É–ø–∞ –∫ —Ä–µ–∫–µ
#

  column
0     ZN
1   CHAS

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [10]:
tasks+=1
pd.read_sql(
    '''
    WITH cheap AS (
        SELECT g.grp, AVG(b.RM) cheap_rm FROM (
            SELECT 25 grp UNION ALL SELECT 50 UNION ALL SELECT 100 UNION ALL SELECT 200 UNION ALL SELECT 300) g
        JOIN (
            SELECT RM, row_number() over (order by MEDV, RM) rn from boston) b
        ON b.rn <= g.grp
        GROUP BY grp
    ),
    luxury AS (
        SELECT AVG(RM) luxury_rm FROM boston WHERE MEDV = (SELECT max(MEDV) FROM boston)
    )
    SELECT grp, cheap_rm, luxury_rm, luxury_rm - cheap_rm diff FROM cheap CROSS JOIN luxury
    ''',
    con,
)
# –ó–∞–º–µ—á–∞–Ω–∏—è: 
#   * –¥–æ–ø–æ–ª–Ω–∏—Ç–µ–ª—å–Ω—É—é —Å–æ—Ä—Ç–∏—Ä–æ–≤–∫—É –ø–æ RM —Å–¥–µ–ª–∞–ª –¥–ª—è –≤–æ—Å–ø—Ä–æ–∏–∑–≤–æ–¥–∏–º–æ—Å—Ç–∏ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–æ–≤ –≤ pandas
#     (–ø—Ä–∏—Å—É—Ç—Å—Ç–≤—É—é—Ç —Ä–∞–∑–Ω—ã–µ –∑–Ω–∞—á–µ–Ω–∏—è RM –¥–ª—è –æ–¥–Ω–æ–≥–æ –∏ —Ç–æ–≥–æ –∂–µ MEDV)
#   * —Ñ–æ—Ä–º—É–ª–∏—Ä–æ–≤–∫–∞ –∑–∞–¥–∞–Ω–∏—è –Ω–µ –≤–ø–æ–ª–Ω–µ –∫–æ—Ä—Ä–µ–∫—Ç–Ω–∞, —Ç.–∫. –¥–∞—Ç–∞—Å–µ—Ç —Å–æ–¥–µ—Ä–∂–∏—Ç –∞–≥—Ä–µ–≥–∏—Ä–æ–≤–∞–Ω–Ω—É—é –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é –æ –≤—Å–µ—Ö –¥–æ–º–∞—Ö 
#     –≤ –∫–∞–∂–¥–æ–º —Ä–∞–π–æ–Ω–µ –ë–æ—Å—Ç–æ–Ω–∞, –∞ –Ω–µ –æ –∫–æ–Ω–∫—Ä–µ—Ç–Ω–æ–º –¥–æ–º–µ. –¢–∞–∫ —á—Ç–æ –ª—É—á—à–µ –≥–æ–≤–æ—Ä–∏—Ç—å –æ —Å—Ä–∞–≤–Ω–µ–Ω–∏–∏ –¥–æ—Ä–æ–≥–∏—Ö –∏ –¥–µ—à–µ–≤—ã—Ö —Ä–∞–π–æ–Ω–æ–≤
#     –ø–æ —Å—Ä–µ–¥–Ω–µ–π (–º–µ–¥–∏–∞–Ω–Ω–æ–π) —Ü–µ–Ω–µ –¥–æ–º–∞
#
# –í—ã–≤–æ–¥—ã:
#   * —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Ä–∞–π–æ–Ω–∞—Ö —Å –¥–æ—Ä–æ–≥–∏–º–∏ –¥–æ–º–∞–º–∏ –≤—ã—à–µ —á–µ–º –≤ –±–µ–¥–Ω—ã—Ö —Ä–∞–π–æ–Ω–∞—Ö
#   * –æ—Ü–µ–Ω–∏—Ç—å –Ω–∞—Å–∫–æ–ª—å–∫–æ —Å–∏–ª—å–Ω–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤–ª–∏—è–µ—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ—Å—Ç–∞—Ç–æ—á–Ω–æ —Å–ª–æ–∂–Ω–æ –ø–æ –¥–∞–Ω–Ω–æ–π –≤—ã–±–æ—Ä–∫–µ, 
#     —Ç.–∫. –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –≤–ª–∏—è—é—Ç –∏ –¥—Ä—É–≥–∏–µ —Ñ–∞–∫—Ç–æ—Ä—ã (—Ä–∞—Å–ø–æ–ª–æ–∂–µ–Ω–∏–µ, —Å–æ—Ü–∏–∞–ª—å–Ω—ã–π —Å—Ç–∞—Ç—É—Å –∂–∏—Ç–µ–ª–µ–π —Ä–∞–π–æ–Ω–∞ –∏ —Ç.–¥.), 
#     –Ω–æ –º–æ–∂–Ω–æ –∑–∞–º–µ—Ç–∏—Ç—å —á—Ç–æ —Å —Ä–æ—Å—Ç–æ–º —á–∏—Å–ª–∞ –±–µ–¥–Ω—ã—Ö —Ä–∞–π–æ–Ω–æ–≤ –≤ –≤—ã–±–æ—Ä–∫–µ —Ä–∞–∑–Ω–∏—Ü–∞ –≤ –∫–æ–ª–∏—á–µ—Å—Ç–≤–µ –∫–æ–º–Ω–∞—Ç —É–º–µ–Ω—å—à–∞–µ—Ç—Å—è –Ω–µ–∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ

   grp  cheap_rm  luxury_rm     diff
0   25   5.69412      7.484  1.78988
1   50   5.75324      7.484  1.73076
2  100   5.87511      7.484  1.60889
3  200   5.91122      7.484  1.57278
4  300   5.97121      7.484  1.51279

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [11]:
tasks+=1
pd.read_sql(
    '''
    SELECT * FROM (
        SELECT LSTAT, MEDV, rank() over (ORDER BY LSTAT) rnk FROM boston
    )
    WHERE MEDV = (SELECT max(MEDV) FROM boston)
    ''',
    con,
)

# –ó–∞–º–µ—á–∞–Ω–∏–µ:
#   * –Ω–∞—Å–∫–æ–ª—å–∫–æ —è –ø–æ–Ω–∏–º–∞—é, LSTAT - —ç—Ç–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ—Ö–æ–∑—è–π—Å—Ç–≤ –≤ —Ä–∞–π–æ–Ω–µ 
#     —Å –Ω–∏–∑–∫–∏–º —Å–æ—Ü–∏–∞–ª—å–Ω–æ-—ç–∫–æ–Ω–æ–º–∏—á–µ—Å–∞–∏–º —Å—Ç–∞—Ç—É—Å–æ–º (–ø—Ä–æ—â–µ –≥–æ–≤–æ—Ä—è, –∑–∞ —á–µ—Ä—Ç–æ–π –±–µ–¥–Ω–æ—Å—Ç–∏)
#   * —á–µ–º –≤—ã—à–µ —Ä–∞–Ω–≥, —Ç–µ–º –±–æ–ª—å—à–µ –±–µ–¥–Ω—è–∫–æ–≤ –≤ —Ä–∞–π–æ–Ω–µ
#
# –í—ã–≤–æ–¥—ã:
#   * –≤–∏–¥–Ω–æ, —á—Ç–æ –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö —Ä–∞–π–æ–Ω–∞—Ö (–ø–æ —Ü–µ–Ω–µ –∑–∞ –¥–æ–º) –¥–æ–ª—è –±–µ–¥–Ω—è–∫–æ–≤ –æ—á–µ–Ω—å –º–∞–ª–∞ (–Ω–∏–∑–∫–∏–π LSTAT)
#   * —Ö–æ—Ç—è –≤–Ω–∏–∑—É —Å–ø–∏—Å–∫–∞ –µ—Å—Ç—å —Ä–∞–π–æ–Ω—ã, –≥–¥–µ –¥–æ–ª—è –±–µ–¥–Ω—è–∫–æ–≤ –ø–æ–≤—ã—à–µ–Ω–∞
#     (LSTAT –¥–ª—è –ø–æ—Å–ª–µ–¥–Ω–µ–π —Å—Ç—Ä–æ–∫–∏ –≤ 5.5 —Ä–∞–∑ –≤—ã—à–µ —á–µ–º –¥–ª—è –ø–µ—Ä–≤–æ–π, –∞ —Ç–∞–∫–∂–µ –≤—ã—Å–æ–∫–∏–π —Ä–∞–Ω–≥)

    LSTAT  MEDV  rnk
0    1.73  50.0    1
1    1.92  50.0    2
2    2.88  50.0    6
3    2.96  50.0    8
4    2.97  50.0    9
5    3.16  50.0   15
6    3.26  50.0   17
7    3.32  50.0   18
8    3.70  50.0   26
9    3.73  50.0   27
10   4.45  50.0   41
11   4.63  50.0   50
12   5.12  50.0   67
13   7.44  50.0  141
14   8.88  50.0  181
15   9.53  50.0  203

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT CASE WHEN CHAS = 0 THEN '–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç' ELSE '–≥—Ä–∞–Ω–∏—á–∏—Ç' END river, AVG(MEDV) avg_price 
    FROM boston GROUP BY CHAS
    ''',
    con,
)

# –í—ã–≤–æ–¥:
#   * –≤ —Ä–∞–π–æ–Ω–∞—Ö, –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π, —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤—ã—à–µ

         river  avg_price
0  –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç  22.093843
1     –≥—Ä–∞–Ω–∏—á–∏—Ç  28.440000

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT column FROM (
        SELECT 'CRIM' column, AVG(CASE WHEN CHAS=0 THEN CRIM END) no_river, AVG(CASE WHEN CHAS=1 THEN CRIM END) has_river FROM boston
        UNION ALL
        SELECT 'ZN', AVG(CASE WHEN CHAS=0 THEN ZN END), AVG(CASE WHEN CHAS=1 THEN ZN END) FROM boston
        UNION ALL
        SELECT 'INDUS', AVG(CASE WHEN CHAS=0 THEN INDUS END), AVG(CASE WHEN CHAS=1 THEN INDUS END) FROM boston
        UNION ALL
        SELECT 'CHAS', AVG(CASE WHEN CHAS=0 THEN CHAS END), AVG(CASE WHEN CHAS=1 THEN CHAS END) FROM boston
        UNION ALL
        SELECT 'NOX', AVG(CASE WHEN CHAS=0 THEN NOX END), AVG(CASE WHEN CHAS=1 THEN NOX END) FROM boston
    )
    WHERE has_river > no_river
    ''',
    con,
)

# –í—ã–≤–æ–¥—ã:
#   * INDUS: –µ—Å–ª–∏ –ø—Ä–∞–≤–∏–ª—å–Ω–æ –ø–æ–Ω—è–ª —Å–º—ã—Å–ª —ç—Ç–æ–π –∫–æ–ª–æ–Ω–∫–∏ (–¥–æ–ª—è –ø—Ä–æ–º–∑–æ–Ω), —Ç–æ –¥–æ–ª—è –ø—Ä–æ–º–∑–æ–Ω –≤—ã—à–µ –≤ —Ä–∞–π–æ–Ω–∞—Ö —É —Ä–µ–∫–∏ 
#     (–≤–∏–¥–∏–º–æ, —á—Ç–æ–±—ã —Å–±—Ä–∞—Å—ã–≤–∞—Ç—å —Ç—É–¥–∞ –æ—Ç—Ö–æ–¥—ã)
#   * CHAS: –≤—ã–≤–æ–¥ —Ç—Ä–∏–≤–∏–∞–ª—å–Ω—ã–π (–º—ã –ø–æ —ç—Ç–æ–π –∫–æ–ª–æ–Ω–∫–µ –∏ –¥–µ–ª–∞–µ–º —Ä–∞–∑–±–∏–µ–Ω–∏–µ) - –≤ —Ä–∞–π–æ–Ω–∞—Ö —É —Ä–µ–∫–∏ –µ—Å—Ç—å —Ä–µ–∫–∞
#   * NOX: –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ –≤—ã—à–µ –≤ —Ä–∞–π–æ–Ω–∞—Ö —É —Ä–µ–∫–∏ 
#     (–≤–æ–∑–º–æ–∂–Ω–æ –µ—Å—Ç—å –∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–∞—è –ø–æ–ª–æ–∂–∏—Ç–µ–ª—å–Ω–∞—è –∫–æ—Ä—Ä–µ–ª—è—Ü–∏—è —Å –¥–æ–ª–µ–π –ø—Ä–æ–º–∑–æ–Ω –≤ —Ä–∞–π–æ–Ω–µ (INDUS))
#

  column
0  INDUS
1   CHAS
2    NOX

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [14]:
tasks+=1
pd.read_sql(
    '''
    WITH indus_pct AS (
        SELECT pct, max(INDUS) indus_val FROM (
            SELECT INDUS, (ntile(10) over (ORDER BY INDUS)) * 10 pct FROM boston
        ) GROUP BY pct
    ),
    nox_pct AS(
        SELECT pct, max(NOX) nox_val FROM (
            SELECT NOX, (ntile(10) over (ORDER BY NOX)) * 10 pct FROM boston
        ) GROUP BY pct
    )
    SELECT i.pct, indus_val, nox_val FROM indus_pct i JOIN nox_pct n ON i.pct = n.pct
    ''',
    con,
)

# –í—ã–≤–æ–¥: –ø–æ –¥–∞–Ω–Ω–æ–π –≤—ã–±–æ—Ä–∫–µ –≤–∏–¥–Ω–æ, —á—Ç–æ –∑–Ω–∞—á–µ–Ω–∏—è —Ä–∞—Å—Ç—É—Ç —Å —Ä–∞–∑–Ω–æ–π —Å–∫–æ—Ä–æ—Å—Ç—å—é: –¥–ª—è INDUS —Ä–∞–∑–Ω–∏—Ü–∞ max/min ~ 9, –∞ –¥–ª—è NOX ~ 2.
# –Ø–≤–Ω–æ–π –≤–∑–∞–∏–º–æ—Å–≤—è–∑–∏ –Ω–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è

   pct  indus_val  nox_val
0   10       2.89    0.426
1   20       4.39    0.442
2   30       5.96    0.472
3   40       7.38    0.507
4   50       9.69    0.538
5   60      13.89    0.580
6   70      18.10    0.609
7   80      18.10    0.671
8   90      19.58    0.713
9  100      27.74    0.871

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [15]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ